#language: ru

@tree
@ExportScenarios
@IgnoreOnCIMainBuild

Функционал: Загрузка документов оборота товаров

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Переменные:
	Импорт "Ввод переменных.feature"

Сценарий: Загрузка товаров и цен

	// Справочник.Товары

	И я проверяю или создаю для справочника "Товары" объекты:
		| 'Ссылка'                                                            | 'ПометкаУдаления' | 'Родитель'                                                          | 'ЭтоГруппа' | 'Код'       | 'Наименование' | 'Артикул'  | 'Поставщик'                                                              | 'Вид'                    |
		| 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df6' | 'False'           | 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db8c51bbb079ae' | 'False'     | '000000225' | 'Товар 1'      | 'art00001' | 'e1cib/data/Справочник.Контрагенты?ref=a9c500055d49b45e11dbf348086715b0' | 'Enum.ВидыТоваров.Товар' |
		| 'e1cib/data/Справочник.Товары?ref=a9bc00055d49b45e11dbc8caefc3ed8a' | 'False'           | 'e1cib/data/Справочник.Товары?ref=a100005056c0000811e3f7c0ef680671' | 'False'     | '000000226' | 'Товар 2'      | 'art00002' | 'e1cib/data/Справочник.Контрагенты?ref=a9bd00055d49b45e11dbd7c695f19911' | 'Enum.ВидыТоваров.Товар' |
		| 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc9cfecc6a7df4' | 'False'           | 'e1cib/data/Справочник.Товары?ref=a100005056c0000811e3f7c0ef680671' | 'False'     | '000000227' | 'Товар 3'      | 'art00003' | 'e1cib/data/Справочник.Контрагенты?ref=a9bd00055d49b45e11dbd7c695f19911' | 'Enum.ВидыТоваров.Товар' |
		| 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db90e17cd1a8f9' | 'False'           | 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db8c51bbb079ae' | 'False'     | '000000228' | 'Товар 4'      | 'art00004' | 'e1cib/data/Справочник.Контрагенты?ref=a9c500055d49b45e11dbf348086715b0' | 'Enum.ВидыТоваров.Товар' |

	// РегистрСведений.Характеристики

	И я проверяю или создаю для регистра сведений "Характеристики" записи:
		| 'Объект'                                                            | 'ВидХарактеристики'                                                                        | 'Номер' | 'Значение'                                                                         |
		| 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df2' | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c422b' |         | 41                                                                                 |
		| 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db90e17cd1a8f9' | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c422b' |         | 36                                                                                 |
		| 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc9cfecc6a7df4' | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=8ca0000d8843cd1b11dc8d043d71008b' |         | 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=8ca0000d8843cd1b11dc8d043d71008d' |
		| 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db90e17cd1a8f9' | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4227' |         | 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4228' |
		| 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db90e17cd1a8f9' | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4227' | 1       | 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4229' |
		| 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db90e17cd1a8f9' | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4227' | 2       | 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c422a' |
		| 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db90e17cd1a8f9' | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4227' | 3       | 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=911f2c4d54d869e611ec04d526e9bb23' |
		| 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df2' | 'e1cib/data/ПланВидовХарактеристик.ВидыХарактеристик?ref=a9b000055d49b45e11db8c4c9d5c4227' |         | 'e1cib/data/Справочник.ЗначенияХарактеристик?ref=911f2c4d54d869e611ec04d526e9bb24' |

	// РегистрСведений.ЦеныТоваров

	И я проверяю или создаю для регистра сведений "ЦеныТоваров" записи:
		| 'Период'            | 'Товар'                                                             | 'ВидЦен'                                                             | 'Цена' |
		| '$НачалоПериода$'   | 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db90e17cd1a8f9' | 'e1cib/data/Справочник.ВидыЦен?refName=Закупочная'                   | 500    |
		| '$НачалоПериода$'   | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df6' | 'e1cib/data/Справочник.ВидыЦен?refName=Закупочная'                   | 550    |
		| '$НачалоПериода$'   | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc9cfecc6a7df4' | 'e1cib/data/Справочник.ВидыЦен?refName=Закупочная'                   | 50     |
		| '$НачалоПериода$'   | 'e1cib/data/Справочник.Товары?ref=a9bc00055d49b45e11dbc8caefc3ed8a' | 'e1cib/data/Справочник.ВидыЦен?refName=Закупочная'                   | 200    |
		| '$СерединаПериода$' | 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db90e17cd1a8f9' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4225' | 600    |
		| '$СерединаПериода$' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df6' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4226' | 650    |
		| '$СерединаПериода$' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc9cfecc6a7df4' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4224' | 100    |
		| '$СерединаПериода$' | 'e1cib/data/Справочник.Товары?ref=a9bc00055d49b45e11dbc8caefc3ed8a' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4224' | 400    |
		| '$КонецПериода$'    | 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db90e17cd1a8f9' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4226' | 700    |
		| '$КонецПериода$'    | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df6' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4225' | 750    |
		| '$КонецПериода$'    | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc9cfecc6a7df4' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4225' | 150    |
		| '$КонецПериода$'    | 'e1cib/data/Справочник.Товары?ref=a9bc00055d49b45e11dbc8caefc3ed8a' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4225' | 200    |

Сценарий: Загрузка документов Заказ

	// Документ.Заказ

	И я проверяю или создаю для документа "Заказ" объекты:
		| 'Ссылка'                                                         | 'ПометкаУдаления' | 'Номер'     | 'Дата'                                                               | 'Проведен' | 'Покупатель'                                                             | 'Склад'                                                             | 'Валюта'                                                            | 'ВидЦен'                                                             | 'Организация'                                                            | 'СостояниеЗаказа'                | 'Автор'                                                                   | 'Сумма' |
		| 'e1cib/data/Документ.Заказ?ref=bbf30050ba5c887711e1fe6190994fe8' | 'False'           | '000000201' | '{Строка(НачалоМесяца(НачалоДня(ТекущаяДата())) + 10)}'              | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=8ca0000d8843cd1b11dc8d043d710079' | 'e1cib/data/Справочник.Склады?ref=a9b000055d49b45e11db8c4c9d5c4221' | 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4421dda1c5' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4225' | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c64' | 'Enum.СостоянияЗаказов.Открыт'   | 'e1cib/data/Справочник.Пользователи?ref=a2bc001d600da75a11e1f76c2216989a' | 72500   |
		| 'e1cib/data/Документ.Заказ?ref=bbef0050ba5c887711e1fc040faf2b27' | 'False'           | '000000202' | '{Строка(НачалоМесяца(НачалоДня(ТекущаяДата())) + 86400 * 15)}' | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=8ca1000d8843cd1b11dc8ea92d97a74a' | 'e1cib/data/Справочник.Склады?ref=a9b000055d49b45e11db8b8bee7616e1' | 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4421dda1c5' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4226' | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c63' | 'Enum.СостоянияЗаказов.Выполнен' | 'e1cib/data/Справочник.Пользователи?ref=a2bc001d600da75a11e1f76c2216989a' | 600     |
		| 'e1cib/data/Документ.Заказ?ref=bbf30050ba5c887711e1fe6190994fe7' | 'False'           | '000000203' | '{Строка(КонецМесяца(КонецДня(ТекущаяДата())) + 10)}'                | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=8ca0000d8843cd1b11dc8d043d71007d' | 'e1cib/data/Справочник.Склады?ref=a9b000055d49b45e11db8b8bdc1aadc2' | 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4421dda1c5' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4224' | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c63' | 'Enum.СостоянияЗаказов.Открыт'   | 'e1cib/data/Справочник.Пользователи?ref=a2bc001d600da75a11e1f76c2216989a' | 13900   |

	И я перезаполняю для объекта табличную часть "Товары":
		| 'Ссылка'                                                         | 'Товар'                                                             | 'Цена' | 'Количество' | 'Сумма' |
		| 'e1cib/data/Документ.Заказ?ref=bbf30050ba5c887711e1fe6190994fe8' | 'e1cib/data/Справочник.Товары?ref=a9bc00055d49b45e11dbc8caefc3ed8a' | 400    | 100          | 40000   |
		| 'e1cib/data/Документ.Заказ?ref=bbf30050ba5c887711e1fe6190994fe8' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df6' | 650    | 50           | 32500   |
		| 'e1cib/data/Документ.Заказ?ref=bbef0050ba5c887711e1fc040faf2b27' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc9cfecc6a7df4' | 50     | 12           | 600     |
		| 'e1cib/data/Документ.Заказ?ref=bbf30050ba5c887711e1fe6190994fe7' | 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db90e17cd1a8f9' | 700    | 7            | 4900    |
		| 'e1cib/data/Документ.Заказ?ref=bbf30050ba5c887711e1fe6190994fe7' | 'e1cib/data/Справочник.Товары?ref=a9bc00055d49b45e11dbc8caefc3ed8a' | 200    | 45           | 9000    |

Сценарий: Загрузка документов ПриходТовара

	// Документ.ПриходТовара

	И я проверяю или создаю для документа "ПриходТовара" объекты:
		| 'Ссылка'                                                                | 'ПометкаУдаления' | 'Номер'     | 'Дата'                                                          | 'Проведен' | 'Поставщик'                                                              | 'Склад'                                                             | 'Валюта'                                                            | 'Организация'                                                            |
		| 'e1cib/data/Документ.ПриходТовара?ref=8029f02f7419800911ee7339ff7dacc0' | 'False'           | '000000068' | '{Строка(НачалоМесяца(НачалоДня(ТекущаяДата())) + 1)}'          | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=8ca1000d8843cd1b11dc8ea92d97a74a' | 'e1cib/data/Справочник.Склады?ref=8ca1000d8843cd1b11dc8eb49faea67b' | 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4c9d5c4222' | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c65' |
		| 'e1cib/data/Документ.ПриходТовара?ref=8029f02f7419800911ee7339ff7dacc1' | 'False'           | '000000069' | '{Строка(НачалоМесяца(НачалоДня(ТекущаяДата())) + 86400 * 10)}' | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=8ca1000d8843cd1b11dc8ea92d97a74a' | 'e1cib/data/Справочник.Склады?ref=8ca1000d8843cd1b11dc8eb49faea67b' | 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4421dda1c5' | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c64' |
		| 'e1cib/data/Документ.ПриходТовара?ref=8029f02f7419800911ee7339ff7dacc2' | 'False'           | '000000070' | '{Строка(НачалоМесяца(НачалоДня(ТекущаяДата())) + 86400 * 25)}' | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=8ca1000d8843cd1b11dc8ea92d97a74a' | 'e1cib/data/Справочник.Склады?ref=8ca1000d8843cd1b11dc8eb49faea67b' | 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4421dda1c5' | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c64' |
		| 'e1cib/data/Документ.ПриходТовара?ref=8029f02f7419800911ee7339ff7dacc3' | 'False'           | '000000071' | '{Строка(НачалоМесяца(НачалоДня(ТекущаяДата())) + 86400 * 15)}' | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=8ca0000d8843cd1b11dc8d043d710076' | 'e1cib/data/Справочник.Склады?ref=8ca1000d8843cd1b11dc8eb49faea67b' | 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4421dda1c5' | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c63' |

	И я перезаполняю для объекта табличную часть "Товары":
		| 'Ссылка'                                                                | 'Товар'                                                             | 'Цена' | 'Количество' | 'Сумма' |
		| 'e1cib/data/Документ.ПриходТовара?ref=8029f02f7419800911ee7339ff7dacc0' | 'e1cib/data/Справочник.Товары?ref=a9bc00055d49b45e11dbc8caefc3ed8a' | 200    | 50           | 10000   |
		| 'e1cib/data/Документ.ПриходТовара?ref=8029f02f7419800911ee7339ff7dacc0' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df6' | 550    | 70           | 38500   |
		| 'e1cib/data/Документ.ПриходТовара?ref=8029f02f7419800911ee7339ff7dacc1' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc9cfecc6a7df4' | 50     | 10           | 500     |
		| 'e1cib/data/Документ.ПриходТовара?ref=8029f02f7419800911ee7339ff7dacc1' | 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db90e17cd1a8f9' | 500    | 15           | 7500    |
		| 'e1cib/data/Документ.ПриходТовара?ref=8029f02f7419800911ee7339ff7dacc1' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df6' | 550    | 1            | 550     |
		| 'e1cib/data/Документ.ПриходТовара?ref=8029f02f7419800911ee7339ff7dacc2' | 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db90e17cd1a8f9' | 500    | 10           | 5000    |
		| 'e1cib/data/Документ.ПриходТовара?ref=8029f02f7419800911ee7339ff7dacc2' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df6' | 550    | 15           | 8250    |
		| 'e1cib/data/Документ.ПриходТовара?ref=8029f02f7419800911ee7339ff7dacc2' | 'e1cib/data/Справочник.Товары?ref=a9bc00055d49b45e11dbc8caefc3ed8a' | 200    | 1            | 200     |
		| 'e1cib/data/Документ.ПриходТовара?ref=8029f02f7419800911ee7339ff7dacc3' | 'e1cib/data/Справочник.Товары?ref=a9bc00055d49b45e11dbc8caefc3ed8a' | 200    | 9            | 1800    |
		| 'e1cib/data/Документ.ПриходТовара?ref=8029f02f7419800911ee7339ff7dacc3' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc9cfecc6a7df4' | 50     | 8            | 400     |
		| 'e1cib/data/Документ.ПриходТовара?ref=8029f02f7419800911ee7339ff7dacc3' | 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db90e17cd1a8f9' | 500    | 8            | 4000    |
		| 'e1cib/data/Документ.ПриходТовара?ref=8029f02f7419800911ee7339ff7dacc3' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df6' | 550    | 7            | 3850    |

Сценарий: Загрузка документов РасходТовара

	// Документ.РасходТовара

	И я проверяю или создаю для документа "РасходТовара" объекты:
		| 'Ссылка'                                                                | 'ПометкаУдаления' | 'Номер'     | 'Дата'                                                        | 'Проведен' | 'Покупатель'                                                             | 'Склад'                                                             | 'Валюта'                                                            | 'ВидЦен'                                                             | 'ОбоснованиеОтгрузки' | 'Организация'                                                            |
		| 'e1cib/data/Документ.РасходТовара?ref=8029f02f7419800911ee7339ff7dacc4' | 'False'           | '000000107' | '{Строка(КонецМесяца(КонецДня(ТекущаяДата())) - 86400 * 15)}' | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=8ca0000d8843cd1b11dc8d043d710076' | 'e1cib/data/Справочник.Склады?ref=8ca1000d8843cd1b11dc8eb49faea67b' | 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4421dda1c5' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4225' | ''                    | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c64' |
		| 'e1cib/data/Документ.РасходТовара?ref=8029f02f7419800911ee7339ff7dacc5' | 'False'           | '000000108' | '{Строка(КонецМесяца(КонецДня(ТекущаяДата())) - 86400 * 10)}' | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=8ca0000d8843cd1b11dc8d043d71007d' | 'e1cib/data/Справочник.Склады?ref=8ca1000d8843cd1b11dc8eb49faea67b' | 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4421dda1c5' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4224' | ''                    | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c64' |

	И я перезаполняю для объекта табличную часть "Товары":
		| 'Ссылка'                                                                | 'Товар'                                                             | 'Цена' | 'Количество' | 'Сумма' |
		| 'e1cib/data/Документ.РасходТовара?ref=8029f02f7419800911ee7339ff7dacc4' | 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db90e17cd1a8f9' | 600    | 5            | 3000    |
		| 'e1cib/data/Документ.РасходТовара?ref=8029f02f7419800911ee7339ff7dacc4' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df6' | 1500   | 1            | 1500    |
		| 'e1cib/data/Документ.РасходТовара?ref=8029f02f7419800911ee7339ff7dacc4' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc9cfecc6a7df4' | 40     | 7            | 280     |
		| 'e1cib/data/Документ.РасходТовара?ref=8029f02f7419800911ee7339ff7dacc4' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df6' | 1500   | 1            | 1500    |
		| 'e1cib/data/Документ.РасходТовара?ref=8029f02f7419800911ee7339ff7dacc5' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc9cfecc6a7df4' | 700    | 5            | 3500    |
		| 'e1cib/data/Документ.РасходТовара?ref=8029f02f7419800911ee7339ff7dacc5' | 'e1cib/data/Справочник.Товары?ref=a9b000055d49b45e11db90e17cd1a8f9' | 900    | 1            | 900     |
		| 'e1cib/data/Документ.РасходТовара?ref=8029f02f7419800911ee7339ff7dacc5' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df6' | 2000   | 7            | 14000   |
		| 'e1cib/data/Документ.РасходТовара?ref=8029f02f7419800911ee7339ff7dacc5' | 'e1cib/data/Справочник.Товары?ref=a9bc00055d49b45e11dbc8caefc3ed8a' | 400    | 1            | 400     |